[
  {
    "title": "TON Telegram Game Bot",
    "description": "A blockchain-based Telegram game bot powered by TON tokens.",
    "image": "/projectImages/telegram-bot.png",
    "image2": "/projectImages/bot-game.jpg",
    "image3": "/projectImages/crypto-game.png",
    "technologies": [
      "JavaScript",
      "Node.js",
      "Telegram API",
      "TON Blockchain",
      "Smart Contracts"
    ],
    "body": "The TON Telegram Game Bot enables users to play casino games and wager TON tokens. Players deposit a minimum of 1 TON token, and the winner takes a portion of the staked tokens. Future updates will include adding multiple game levels and more advanced features built on the TON blockchain.\nThe project showcases expertise in integrating blockchain with real-time applications and leveraging Telegram's API for user interaction. This bot represents an innovative step in merging blockchain and social media platforms for interactive gaming experiences.",
    "github": "https://github.com/iBuild-ts/my-portfolio",
    "deployed": "https://t.me/Tonacebot",
    "id": "7"
  },
  {
    "title": "Andybnb Meme",
    "description": "A decentralized meme token project built on the Binance Smart Chain.",
    "image": "/projectImages/andy-meme.png",
    "image2": "/projectImages/meme-token.png",
    "image3": "/projectImages/bnb-network.png",
    "technologies": [
      "Solidity",
      "Web3.js",
      "React",
      "Binance Smart Chain",
      "Metamask"
    ],
    "body": "Andy Meme is a decentralized dog meme token platform built on the Binance Smart Chain (BNB network). The project allows users to mint, trade, and showcase meme tokens with integrated support for BNB transactions. \nThe website offers an intuitive interface for interacting with the blockchain, supporting wallet connections like Metamask for easy token transfers. This project highlights experience in deploying smart contracts, building blockchain-based DApps, and integrating BNB payments seamlessly into a web interface.\nIn addition to basic token functionality, users can participate in meme contests, vote on favorite memes, and earn rewards in $ANDY tokens.",
    "github": "https://github.com/iBuild-ts/my-portfolio",
    "deployed": "https://andybnb.vip/",
    "id": "8"
  },
  {
    "title": "Dogex",
    "description": "An AI-powered dog meme project on the Ethereum blockchain.",
    "image": "/projectImages/dogex.png",
    "image2": "/projectImages/ai-dog.png",
    "image3": "/projectImages/ethereum.png",
    "technologies": [
      "Solidity",
      "Web3.js",
      "React",
      "Ethereum",
      "AI/ML",
      "Metamask"
    ],
    "body": "Dogex is an AI-powered meme token project that brings together the fun of dog memes and the cutting-edge power of artificial intelligence on the Ethereum blockchain. Users can mint, trade, and interact with AI-generated dog memes, supported by Ethereum-based transactions.\nThe project showcases your ability to combine **AI/ML models** for content generation with **Ethereum smart contracts** for decentralized token creation and management. The platform supports **Metamask wallet integration** for secure and seamless ETH transactions.",
    "github": "https://github.com/iBuild-ts",
    "deployed": "https://www.dogex.meme/",
    "id": "9"
  },
  {
    "title": "Skellingtonomics",
    "description": "A meme website built on the Solana blockchain.",
    "image": "/projectImages/skellingtonomics.png",
    "image2": "/projectImages/skull-meme.png",
    "image3": "/projectImages/solana.png",
    "technologies": [
      "Solidity",
      "Solana",
      "React",
      "Rust",
      "Anchor",
      "Phantom Wallet"
    ],
    "body": "Skellingtonomics is a meme website developed on the Solana blockchain, featuring a unique meme token ecosystem powered by Solana's high-performance network. Users can mint, trade, and interact with meme tokens, while leveraging Solana's low fees and fast transactions.\nThe platform showcases advanced Solana development skills, using the Anchor framework and integrating Solana smart contracts to handle meme token creation and transactions. This project also supports **Phantom wallet integration** for secure token management, enabling users to interact with the Solana ecosystem directly from the web interface.",
    "github": "https://github.com/yourusername/skellingtonomics",
    "deployed": "https://skellingtonomics.com",
    "bgcolor": "#8A2BE2",
    "id": "10"
  },
  {
    "title": "Routes",
    "description": "Plan Safe Routes",
    "image": "/projectImages/bike.png",
    "image2": "/projectImages/cyclingfamily.jpeg",
    "image3": "/projectImages/routes3.png",
    "body": "During my immersive coding bootcamp experience, I collaborated with a team to develop a sophisticated project — a MVP version with a distinct emphasis on route optimisation. Demonstrating a comprehensive understanding of the project's intricacies, I took charge of the entire route management aspect.\nThe purpose of this initiative was to enhance the safety of young cyclists. Leveraged Leaflet.js and TomTom's Routing/Reverse Geolocation APIs.\nIn practical terms, this translates to the creation of a interactive map. Users can intricately plan their routes, considering factors such as real-time traffic updates, designated bike lanes, and terrain gradients. The result is a visually appealing mapping experience. An adventure plotted with utmost consideration for safety and enjoyment.",
    "technologies": [
      "Leaflet",
      "jQuery",
      "Bootstrap",
      "HTML",
      "CSS"
    ],
    "github": "https://github.com/iBuild-ts",
    "deployed": "https://norrinradd8.github.io/bike_buddy/",
    "bgcolor": "var(--hl2-color)",
    "id": "1"
  },
  {
    "title": "AIBitcoin",
    "description": "A BNB staking and rewarding system with a referral program.",
    "image": "/projectImages/aibitcoin.png",
    "image2": "/projectImages/bnb-staking.png",
    "image3": "/projectImages/referral-system.png",
    "technologies": [
      "BNB Chain",
      "Solidity",
      "React",
      "Web3.js",
      "Tailwind CSS",
      "Metamask"
    ],
    "body": "AIBitcoin is a staking and rewarding platform designed for the **BNB network**, featuring a robust referral system that incentivizes users for bringing in more participants. Users can stake their BNB tokens to earn rewards over time, while the integrated referral system allows users to invite others and gain extra benefits. \nThe platform includes **secure wallet connections** using Metamask and provides a user-friendly interface for managing staking rewards and referrals. With a seamless BNB integration, AIBitcoin ensures fast transactions and a transparent rewarding process.\nBuilt with **Solidity** and **Web3.js**, the platform highlights blockchain development skills, focusing on secure staking, reward distribution, and referral tracking.",
    "github": "https://github.com/yourusername/aibitcoin",
    "deployed": "https://aibitcoin.com",
    "bgcolor": "#f0b90b",
    "id": "11"
  },
  {
    "title": "EdgingSolana",
    "description": "A meme project built on the Solana blockchain.",
    "image": "/projectImages/edgingsolana.png",
    "image2": "/projectImages/solana-meme.png",
    "image3": "/projectImages/solana-edging.png",
    "technologies": [
      "Solana",
      "Rust",
      "Anchor Framework",
      "React",
      "Web3.js",
      "Tailwind CSS"
    ],
    "body": "EdgingSolana is a fun and engaging meme project that leverages the **Solana blockchain** to create a unique crypto experience. This project focuses on building a meme culture while utilizing the **high-speed and low-cost transactions** provided by Solana.\nThe website showcases the project, offering a smooth user experience for those interested in engaging with the **Solana ecosystem**. With a light-hearted approach, EdgingSolana is aimed at engaging the crypto community with humor and a strong meme aesthetic.\nThe project utilizes modern web development tools like **Rust** for smart contract development and the **Anchor Framework** for easy integration with Solana programs, alongside a responsive frontend built with **React** and **Tailwind CSS**.",
    "github": "https://github.com/yourusername/edgingsolana",
    "deployed": "https://edgingsolana.com",
    "bgcolor": "#9945FF",
    "id": "12"
  },
  {
    "title": "News",
    "description": "F1 Hub",
    "image": "/projectImages/P1.png",
    "image2": "/projectImages/f1.jpeg",
    "image3": "/projectImages/p13.png",
    "body": "P1 is a web application designed to be a hub for Formula 1 fans. It brings together news, standings, and an interactive card game in one platform.\nThe app features a responsive layout with animated, polished visuals to provide an immersive user experience. The news section stays up-to-date on the latest happenings in the F1 world.\nThe centerpiece is a card game that puts users' F1 knowledge to the test in a competitive, engaging format. Game mechanics reward expertise in drivers, teams, and racing trivia.\nBuilt using modern web development tools, this project shows skills in:\n➤ Creating visually appealing, animated interfaces\n➤ Integrating real-time data feeds and news\n➤ Developing interactive game mechanics with competitive elements\n➤ Providing an all-in-one web app for a niche audience\nOverall, P1 aims to establish an exciting online space for Formula 1 fans to follow the sport, connect with a community, and test their expert knowledge.",
    "technologies": [
      "React",
      "Framer Motion",
      "Bootstrap",
      "HTML",
      "CSS"
    ],
    "github": "https://github.com/iBuild-ts",
    "deployed": "https://p1-heroes.netlify.app/",
    "bgcolor": "#e47911",
    "id": "5"
  }
]